Repository: 84000/data-translation-memory
Catalog: toh44-31_84000-the-ten-bhumis.tmx
Source language: bo
Languages: en

source: །ཡེ་ཤེས་མངོན་འདོད་མཁས་པ་བརྒྱད་པ་ཡོངས་སུ་གནོན།
en: Desiring wisdom, the wise ascend to the eighth bhūmi.

source: །བསོད་ནམས་ཡེ་ཤེས་ཉེར་བསྩགས་སྙིང་རྗེ་བྱམས་ལྡན་ཞིང་།
en: “They have obtained merit and wisdom and are united with compassion and love.

source: །ཚད་མེད་སེམས་ཀྱི་རྗེས་སོང་མཁའ་དང་འདྲ་བའི་བློ།
en: They follow the path of immeasurable wisdom, and their understanding is like space.

source: །དྲང་སྲོང་ཆེན་པོ་ཆོས་ཐོས་རྟོགས་པའི་སྟོབས་ལྡན་པ།
en: They are great sages who have the power of certainty in the Dharma they have heard.

source: །མྱི་སྐྱེ་བ་ཡི་བཟོད་པ་ཕྲ་ཞིང་ཞི་བ་རབ་ཏུ་འཐོབ།
en: They have attained the acceptance that is the subtle tranquility of birthlessness.

source: །སྔ་ནས་མ་སྐྱེ་མི་སྐྱེ་མཚན་ཉིད་མེད་པ་དང་། །མ་བྱུང་འཇིག་པ་མེད་ཅིང་རྒྱུ་བ་མེད་པ་དང་། །དངོས་པོ་སྐྱེ་འཇིག་མེད་པའི་དེ་ཉིད་རྟོག་མེད་པ།
en: “Primordial birthlessness, nonarising, featurelessness, Without origination or destruction, without contrivance, Having no existing nature, the concept-free true nature,

source: །ཡིད་དང་སེམས་ཀྱི་རྒྱུ་བ་མེད་ཅིང་ནམ་མཁའ་འདྲ།
en: It is devoid of the activity of mentation and mind; it is like space.

source: །དེ་དག་འདི་འདྲའི་བཟོད་ལྡན་སྤྲོས་པ་མེད་གྱུར་པའི།
en: “They who possess that acceptance, who are without conceptual elaboration,

source: །མཁས་པ་ཟབ་སྤྱོད་ཞི་བའི་གནས་རབ་ཐོབ་པ་ཡིན།
en: Who have attained the way of peace, are the wise who have profound steadfastness.

source: །དགྲ་བཅོམ་རང་རྒྱལ་འགྲོ་བ་ཀུན་གྱིས་ཤེས་པར་དཀའ།
en: This cannot be conceived of by any being, arhat, or pratyekabuddha,

source: །མཚན་མ་སྣ་ཚོགས་འཛིན་པའི་འདུ་ཤེས་རྣམ་པར་བསྩལ།
en: Because it is free of the mind’s identification that fixes on features.

source: །དེ་ལྟར་གནས་པའི་ཡིད་དང་སེམས་དང་རྟོག་པ་མེད།
en: “In that state there is no mentation, mind, or thought,

source: །དགེ་སློང་འགོག་དང་ལྡན་པར་རྣམ་པར་མྱི་རྟོག་ཐོབ།
en: Like a bhikṣu who has reached the attainment of the state of cessation,

source: །རྨི་ལམ་ཆུས་ཁྱེར་གཉིད་སད་བཞིན་དུ་རྩོལ་དང་བྲལ།
en: Like the absence of effort in someone awake from a dream of being caught in a flood,

source: །ཚངས་པའི་གནས་ཀྱི་འདོད་པ་ཇི་བཞིན་གཉིས་ཀྱང་མེད།
en: And like being devoid of attachment to pleasures in the Brahmā realm.

source: །སྔོན་གྱི་བྱིན་གྱིས་བདེ་གཤེགས་ཡང་དག་བསྐུལ་བ་མཛད།
en: “The sugatas who have previously blessed them exhort them

source: །འདི་ནི་བདེ་གཤེགས་དབང་བསྐུར་བཟོད་པ་དམ་པ་སྟེ།
en: As they receive the consecration of the sugatas for sublime acceptance:

source: །ངེད་ཀྱི་ཡེ་ཤེས་སྟོབས་ཡང་སངས་རྒྱས་ཆོས་ཀྱི་རྣམས།
en: ‘We have vast wisdom and the supreme qualities of buddhahood.

source: །དེ་དག་ཁྱོད་ལ་མེད་ཀྱིས་དེ་ལ་བརྩོན་འགྲུས་རྩོམ།
en: You do not have them and therefore should apply yourself with diligence.

source: །ཅི་ཕན་ཁྱོད་ཀྱི་ཉོན་མོངས་འབར་བ་ཀུན་ཞི་ཡང་།
en: ‘What benefit is there in your extinguishing the fire of your kleśas

source: །འཇིག་རྟེན་ཉོན་མོངས་མྱེས་ཚིག་དེ་དག་མི་བལྟ་འམ།
en: When the fire of the kleśas that burns beings is not extinguished?

source: །སེམས་ཅན་ཕན་ཕྱིར་སྤྱད་པའི་སྔོན་གྱི་སྨོན་ལམ་སེམས།
en: Remember your prayers in the past and act in order to benefit beings.

source: །འགྲོ་བ་མཐར་རྒྱུར་ཡེ་ཤེས་དོན་ཞུགས་ཤེས་པར་གྱིས།
en: Activity that is dedicated to the goal of wisdom is the cause of the liberation of beings.

source: །ཆོས་ཉིད་དེ་བཞིན་ཉིད་འདི་མྱི་རྟོག་རྟག་ཏུ་འདུག །ས་འདི་རྒྱལ་བ་ཉན་ཐོས་རང་རྒྱལ་ཀུན་གྱི་སྟེ།
en: ‘This true nature of phenomena, the nonconceptual truth, is always present For all the buddhas, jinas, śrāvakas, and pratyekabuddhas.

source: །འདིས་ནི་འཇིག་རྟེན་དག་ཏུ་སྟོབས་བཅུ་མི་བརྗོད་དོ།
en: It is not through these ten strengths that it manifests to beings,

source: །གཞན་དུ་ཡེ་ཤེས་ཡངས་པ་དུས་གསུམ་ཚད་ཀྱིས་བརྗོད།
en: But only through vast wisdom unimpeded by the three times.’

source: །དེ་ལྟར་དེ་ལ་མཚུངས་མེད་ལྷ་དང་མྱིས་མཆོད་པ།
en: “In that way the unequaled ones, honored by devas and humans,

source: །ཡེ་ཤེས་སྒོ་མོ་རྣམ་མང་ཉེ་བར་བསྒྲུབ་པ་མཛད།
en: Accomplish the discernment of a variety of doorways to wisdom,

source: །རྒྱལ་བའི་ཆོས་བསྒྲུབ་ཕ་རོལ་མཐའ་ཡས་གཞུག་མཛད་པ།
en: The infinite perfections of the completion of the Jina’s Dharma,

source: །དེ་ལ་སྔོན་གྱི་བྱང་ཆུབ་སྤྱོད་པས་ཆར་མྱི་འགྲོ།
en: Their previous practices for enlightenment not being even a fraction of it.

source: །ཁྱུ་མཆོག་དེ་དག་ཡེ་ཤེས་ས་མཆོག་འདི་ཐོབ་ནས།
en: “These leaders attain this perfect bhūmi of wisdom.

source: །ཕྱོགས་རྣམས་ཀུན་ཏུ་སྐད་ཅིག་གཅིག་གིས་རྒྱས་འགེངས་པ།
en: In one instant they entirely pervade all directions.

source: །ཡེ་ཤེས་ཤུགས་དང་ལྡན་ཞིང་མངོན་ཤེས་མཆོག་ཐོབ་པས།
en: They gain entry into wisdom and have attained perfect clairvoyance.

source: །རྒྱ་མཚོ་ཆེར་ཕྱིན་གྲུ་ཆེན་རླུང་གིས་བཀུར་བ་བཞིན།
en: They are like a great ship being driven by the wind on the ocean.

source: །ཆེད་དུ་བསྐྱོད་སེམས་བྲལ་ཞིང་ཡེ་ཤེས་ལས་ལ་གནས།
en: “They are free of mental effort while remaining in the activity of wisdom.

source: །ཞིང་རྣམས་འབྱུང་ཞིང་གནས་པ་རྣམ་པར་དཔྱོད་པ་བྱེད།
en: They observe the arising, development, remaining, and destruction of worlds,

source: །ཁམས་རྣམས་བཞི་པོ་ཁ་དོག་ཐ་དད་ཡངས་པ་དང་། །ཕྲ་ཞིང་ཆེ་དང་རྣམ་པར་ཕྱེ་ལ་ཡང་དག་འཇུག །སྟོང་གསུམ་ཤིན་ཏུ་རྡུལ་ཕྲ་ཀུན་ལ་འཇུག་བྱེད་དེ།
en: And the vast variations of the four elements. They attain the discernment of the small and the vast. “They can discern all the atoms in a billion-world universe

source: །ཁམས་བཞི་འགྲོ་བའི་ལུས་རྣམས་རྣམ་པར་ཕྱེ་བ་དང་། །རྒྱུ་དྲུག་རིན་ཆེན་རྣམ་པར་ཕྱེ་བའི་རྡུལ་ཕྲན་རྣམས།
en: And the division into four elements within the bodies of beings. The division into atoms of precious materials and the higher realms is analyzed,

source: །རྣམ་པར་ཕྱེ་ཞིང་ཡེ་ཤེས་ཡུལ་གྱིས་མ་ལུས་བགྲང་།
en: And in the scope of their wisdom all are enumerated without omission. “The wise, their minds developed in wisdom,

source: །ཡེ་ཤེས་རྣམས་བསྒོམས་ཡིད་ལྡན་ལུས་རྣམས་ཐམས་ཅད་དུ། །འགྲོ་བའི་དོན་ཕྱིར་རང་གི་ལུས་རྣམས་གཟུད་པ་བྱེད།
en: Adopt all bodies as their own body, in order to benefit beings.

source: །སྟོང་གསུམ་ཐམས་ཅད་སྣ་ཚོགས་གཟུགས་ཀྱིས་ཁྱབ་བྱས་ཤིང་།
en: They pervade the entire billion-world universe with various forms

source: །འཇིག་རྟེན་མཐའ་ཡས་དག་ཏུ་སྣ་ཚོགས་ལུས་ཀྱང་སྟོན།
en: And manifest various bodies in endless worlds.

source: །བར་སྣང་མཁའ་ལ་ཉི་ཟླ་རླུང་གིས་རྒྱུ་འགྲོ་ཡང་།
en: “Even though the sun and moon are moved through the sky by the wind,

source: །སོ་སོའི་དཀྱིལ་འཁོར་གཟུགས་བརྙན་ཆུ་དཀྱིལ་རབ་ཏུ་སྣང་།
en: They create the reflections in water of their own disks.

source: །དེ་བཞིན་མི་གཡོའི་ཆོས་ལ་ཡེ་ཤེས་དམ་པས་རྒྱུ།
en: In that way, although they remain in the highest wisdom, in the stainless true nature,

source: །བསམ་དག་འགྲོ་བ་རྣམས་ལ་མཁས་པའི་གཟུགས་བརྙན་སྣང་།
en: The wise create illusory appearances in order to purify beings.

source: །འགྲོ་བའི་བསམ་པ་བཞིན་དུ་ལུས་ཀྱི་རྣམ་ཕྱེ་བ།
en: “They manifest, in accordance with the aspirations of beings, Various kinds of bodies in all assemblies in all worlds.

source: །མྱི་དང་ལྷ་ཡི་འཁོར་རྣམས་ཀུན་ཏུ་སྟོན་པ་བྱེད།
en: They manifest as pratyekabuddhas, bodhisattvas, and śrāvakas,

source: །ཉན་ཐོས་རང་རྒྱལ་བདེ་གཤེགས་སྲས་ཀྱི་ལུས་རྣམས་དང་། །བདེ་བར་གཤེགས་སྐུ་ཡན་ལག་བརྒྱད་པ་རབ་ཏུ་སྟོན།
en: And as the beautifully adorned bodies of sugatas.

source: །སེམས་ཅན་ཞིང་དང་དེ་བཞིན་ལས་ཀྱི་རྣམ་སྨིན་ལུས།
en: “They manifest bodies of beings, of realms, and similarly of ripened karma,

source: །འཕགས་ལུས་སྣ་ཚོགས་དེ་བཞིན་ཆོས་དང་ཡེ་ཤེས་ལུས།
en: Various sublime bodies, bodies of Dharma and wisdom,

source: །ནམ་མཁའི་ལུས་དང་མཉམ་པ་ཉིད་དུ་ཁྱུ་མཆོག་ལྡན།
en: And the preeminent body of space of complete equality,

source: །རྫུ་འཕྲུལ་སྣ་ཚོགས་འགྲོ་བ་ཚིམ་པར་བྱ་ཕྱིར་སྟོན།
en: And they display a variety of miracles in order to bring relief to beings.

source: །དབང་བཅུ་དྲི་མ་མྱེད་པའི་ཡེ་ཤེས་དཔྱོད་པ་ཐོབ།
en: “They attain the discernment of stainless wisdom and possess the ten strengths.

source: །ཡེ་ཤེས་སྤྱོད་དང་ལས་རྣམས་སྙིང་རྗེ་འཐུན་པ་འང་ཐོབ། །ལས་རྣམས་ཇི་སྙེད་རྒྱལ་བའི་ཆོས་རྣམས་ཡོངས་སུ་བསྒྲུབ།
en: They attain wisdom’s activities, which are in accord with love and compassion.

source: །སྡོམ་པ་གསུམ་ལ་གནས་ཤིང་མི་གཡོ་རི་རབ་བཞིན།
en: Through the three vows they remain as steadfast as a mountain In all the activities received from the Dharma of the jinas.

source: །རྒྱལ་སྲས་རྣམས་ཀྱི་སྟོབས་བཅུ་བསྐྱོད་པར་མི་ནུས་པ།
en: “The ten strengths of the bodhisattvas are unshakable.

source: །དེ་དག་ཀུན་ལྡན་བདུད་རྣམས་ཀུན་གྱིས་ཡོང་མི་ཟློག །སངས་རྒྱས་བྱིན་རླབས་བརྒྱ་བྱིན་ཚངས་པས་ཕྱག་ཀྱང་བྱ།
en: Having attained them, no māras can take them away. They are consecrated by the buddhas, Śakra and Brahmā pay them homage,

source: །ལག་ན་རྡོ་རྗེའི་དཔུང་རྣམས་རྟག་ཏུ་ཕྱི་བཞིན་འབྲང་།
en: And they are always followed by Vajrapāṇi’s legions.

source: །ས་ཕྱོགས་འདི་ལ་གནས་པའི་ཡོན་ཏན་མཐའ་ཡས་ཏེ།
en: “There is no end to the qualities that are attained on this bhūmi.

source: །དེ་དག་བསྐལ་པ་ཁྲག་ཁྲིག་སྟོང་གིས་ཟད་མི་ནུས།
en: They will not cease even in ten billion eons.

source: །དེ་དག་སངས་རྒྱས་བྱེ་བ་བསྙེན་བཀུར་ཡང་བྱེད་པས།
en: They serve a vast number of myriad buddhas

source: །རྒྱལ་པོའི་མགོ་ལ་འདུག་པའི་རྒྱན་བཞིན་ཤིན་ཏུ་གསལ།
en: And are as radiant as an ornament upon a king’s head.

source: །ས་ཕྱོགས་འདི་གནས་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་ལྡན་པ།
en: “The wise bodhisattvas who are on this bhūmi

source: །སྟོང་གི་བདག་པོ་ཚངས་ཆེན་ཡོན་ཏན་མང་པོར་འགྱུར།
en: Become a great Brahmā, a sovereign of the universe, a lord of qualities.

source: །ཐེག་པ་གསུམ་སྟོན་ཡོངས་སུ་མྱི་འཁྲུགས་མི་འཕྲོགས་ཏེ།
en: Their teaching of the three yānas is unshakable and unassailable.

source: །འོད་བཟང་བྱམས་པའི་བསམ་པས་འགྲོ་བའི་ཉོན་མོངས་སེལ།
en: The beautiful light of their love dispels the kleśas of beings.

source: །སྐད་ཅིག་གཅིག་ཏུ་སྟོང་ཕྲག་བཅུ་ཡི་ཞིང་རྣམས་ཀྱི།
en: “In one instant they attain as many samādhis

source: །རྡུལ་ཁམས་ཇི་སྙེད་དེ་སྙེད་ཏིང་འཛིན་ལྡན་པ་འཐོབ།
en: As there are atoms in a million realms.

source: །ཕྱོགས་བཅུའི་སེམས་ཅན་གཙོ་བོ་དེ་སྙེད་མང་པོ་མཐོང་།
en: They see that many great beings in the ten directions

source: །ཡན་ཅད་སྨོན་ལམ་མཆོག་གི་རྒྱན་ཅན་གཅིག་མིན་ནོ།
en: And have even more numerous supreme manifestations from prayer.

source: །འདི་ནི་མདོར་བསྡུས་རྒྱལ་སྲས་ཀྱིས།
en: “This is in brief the teaching

source: །ས་བརྒྱད་ཤིན་ཏུ་བསྟན་པ་སྟེ།
en: Of the eighth bodhisattva bhūmi; A detailed teaching would not conclude

source: །རྒྱ་ཆེ་བསྐལ་པ་བྱེ་བར་ཡང་། །ཐམས་ཅད་མཐར་ཕྱིན་མྱི་ནུས་སོ།
en: Even in ten million eons.”

source: །བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་སྟེ་མི་གཡོ་བ་ཞེས་བྱ་བའོ།། །།སངས་རྒྱས་རྨད་ག་ཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།། བམ་པོ་བཅུ་དགུ་པ།
en: That is the bodhisattva bhūmi called Unwavering.

source: །ས་ཡི་དམ་པ་འདི་བཤད་ཚེ།
en: When this sublime bhūmi was explained

source: །དེ་བཞིན་གཤེགས་པའི་བྱིན་རླབས་ཀྱིས།
en: The blessing of the lord of humans

source: །ཚད་མེད་བསམ་གྱིས་མི་ཁྱབ་པའི།
en: Caused countless inconceivable

source: །བྱེ་བའི་ཞིང་རྣམས་གཡོས་པར་གྱུར།
en: Millions of realms to shake.

source: །ཐམས་ཅད་གཟིགས་པའི་སྐུ་ལས་ཀྱང་།
en: From the body of the one who sees all

source: །འོད་གཟེར་ཡིད་དུ་འོང་བ་བཀྱེ།
en: There radiated beautiful rays of light.

source: །དེས་ནི་ཞིང་རྣམས་སྣང་བར་བྱས།
en: They illuminated all realms,

source: །སེམས་ཅན་རྣམས་ཀྱང་བདེ་བར་གྱུར།
en: And all beings became happy,

source: །བྱང་ཆུབ་སེམས་དཔའ་སྟོང་སྙེད་ཀྱང་།
en: Thousands of bodhisattvas

source: །བར་སྣང་གནས་ལ་འཁོད་གྱུར་ཏེ།
en: Were present in the sky.

source: །ལྷ་རྫས་ལྷག་པའི་མཆོད་པ་ཡིས།
en: With offerings higher than those of the devas,

source: །གསུང་པའི་མཆོག་ལ་མཆོད་པ་བྱེད།
en: They made offerings to the one with supreme speech.

source: །ལྷ་ཡི་རྒྱལ་པོ་དབང་ཕྱུག་དང་། །དབང་བསྒྱུར་རྣམས་ཀྱང་དགའ་བར་གྱུར།
en: The great lords, the devas, And Vaśavartin were delighted.

source: །མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས།
en: They offered various kinds of offerings

source: །ཡོན་ཏན་རྒྱ་མཚོ་མཆོད་པ་བྱེད།
en: To the one who is an ocean of qualities.

source: །དེ་ནས་ལྷ་མི་བུ་མོ་སྟོང་།
en: Then thousands of goddesses,

source: །དགའ་ཞིང་དབང་པོ་བདེར་གྱུར་པས། །སྦྱར་ལེགས་སྙན་པའི་གླུ་ཡི་དབྱངས།
en: Delighted and with their senses pleased,

source: །སྟོན་པ་མཆོད་པའི་དོན་དུ་ལེན།
en: Made an offering to the teacher Of a divine and harmonious song.

source: །རོལ་མོའི་སྒྲ་དབྱངས་དེ་དག་ལས།
en: Accompanied by the sound of musical instruments,

source: །དྲང་སྲོང་ཆེན་པོའི་བྱིན་རླབས་ཀྱིས།
en: Through the blessing of the great sage,

source: །འདི་འདྲའི་སྒྲ་དབྱངས་སྟོང་སྙེད་དུ།
en: This melodious song

source: །སྙན་པའི་དབྱངས་སུ་གྲག་པར་གྱུར།
en: Resounded a thousandfold:

source: །ཞི་དུལ་རབ་ཞི་དྲི་མ་ཐམས་ཅད་མྱེད་གྱུར་ཅིང་།
en: “All these bodhisattvas are free of defects and stains.

source: །ས་ཡི་མཆོག་དང་ལྡན་པས་སྤྱོད་པ་ལེགས་སྤྱོད་པ།
en: They have attained the supreme bhūmi and have radiant conduct.

source: །ཕྱོགས་བཅུར་འགྲོ་ལ་ཕན་པར་སྤྱོད་པའི་ཁྱུ་མཆོག་རྣམས།
en: These leaders act for the benefit of all beings in the ten directions.

source: །མཁའ་དབྱིངས་འདྲ་བའི་ཡིད་ཀྱི་རྒྱལ་བའི་སྤྱོད་པ་སྟོན།
en: They display the conduct of the jinas with minds that are like space.

source: །མྱི་ཡི་གནས་དང་ལྷ་ཡི་གནས་དང་ཀླུ་གནས་སུ།
en: “In the various realms of humans, devas, and nāgas,

source: །ཕྱོགས་བཅུར་བསོད་ནམས་སྟོབས་ཀྱིས་རྒྱན་རྣམས་མང་པོ་བྱུང་།
en: In the ten directions appear adornments through the power of merit.

source: དེ་ལས་ཡང་དུ་རྒྱལ་སྲས་ཡེ་ཤེས་ལ་མོས་པ།
en: Greater than that is the unequaled teaching of the bodhisattva,

source: །རྒྱལ་བའི་ཡོན་ཏན་བསྔགས་པ་རྒྱ་ཆེན་རབ་ཏུ་སྟོན།
en: The delightful path of the jinas illuminated by the bodhisattva.

source: །ཞིང་གཅིག་མ་གཡོས་རྡུལ་མེད་ཞིང་རྣམས་ཐམས་ཅད་དུ།
en: “Without departing from one realm they go to stainless realms

source: །འགྲོ་ལ་ཕན་བྱེད་ཟླ་བ་ལྟ་བུའི་འོད་ལྡན་པ།
en: In order to benefit beings, shining like the moon.

source: །ཐམས་ཅད་དབྱངས་སུ་འདུ་ཤེས་སེམས་ཞི་ཡིད་རབ་ཀྱིས།
en: Their mentation is pacified, their minds have relinquished sound,

source: །སོ་སོའི་སྐད་བཞིན་སྒྲ་སྐད་བརྒྱ་ཡང་རྣམ་པར་བརྗོད།
en: And they speak in hundreds of languages as appropriate to each being.

source: །སེམས་ཅན་གང་རྣམས་བློ་ཞན་སེམས་ཡིད་དམར་གྱུར་པ།
en: “To those beings with inferior minds who are focused on unhappiness,

source: །དེ་ལ་མཁས་པ་ཁྱུ་མཆོག་ཉན་ཐོས་སྤྱོད་པ་སྟོན།
en: A wise great being gives the teachings of the śrāvaka conduct.

source: །སེམས་ཅན་གང་རྣམས་སེམས་རྣོ་རང་རྒྱལ་ཐེག་བརྩོན་པ།
en: To those beings who have sharp minds and are intent on the nature of causes,

source: །དེ་ལ་རྡུལ་མེད་རང་རྒྱལ་ཐེག་པའི་ཡེ་ཤེས་སྟོན།
en: The stainless ones teach the wisdom of the Pratyeka­buddha­yāna.

source: །སེམས་ཅན་གང་རྣམས་ཕན་སེམས་སྙིང་རྗེ་བརྩེ་ཡིད་ཅན།
en: “To those beings who have loving minds that wish to benefit others

source: །དེ་ལ་དེ་དག་རྒྱལ་སྲས་སྤྱོད་པའི་མཆོག་ཀྱང་སྟོན།
en: They teach conduct of the bodhisattvas.

source: །སེམས་ཅན་གང་རྣམས་བློ་མཆོག་དམ་པའི་ཡིད་མོས་པ།
en: To those beings who are intent upon the highest supreme knowledge

source: དེ་ལ་མཁས་པ་ཚད་མེད་སངས་རྒྱས་སྐུ་སྟོན་ཏོ།
en: They teach the unequaled buddhakāya.

source: །ཇི་ལྟར་སྒྱུ་མཁན་འགྲོ་བ་རྣམས་ལ་སྒྱུ་སྟོན་པ།
en: “Just as a conjurer manifests illusions to beings,

source: །ལུས་མང་བྱེ་བ་སྣ་ཚོགས་དེ་དག་དངོས་པོ་མྱེད།
en: Millions of different kinds of bodies that have no existence,

source: །དེ་བཞིན་རྒྱལ་སྲས་མཁས་པ་ཡེ་ཤེས་སྒྱུ་མཁས་པ།
en: In the same way, the wise bodhisattva, intent on wisdom’s illusions,

source: །སྤྱོད་པ་ཐམས་ཅད་སྟོན་ཀྱང་དེ་དག་དངོས་པོ་མེད།
en: Manifests all kinds of conduct that have no existence.”

source: །འདི་འདྲའི་སྒྲ་སྐད་བརྒྱ་སྟོང་དུ། །སྙན་པའི་དབྱངས་སུ་བརྗོད་བྱས་ནས།
en: In that way they sang thousands of beautiful songs,

source: །ལྷའི་བུ་མོ་མི་སྨྲ་བར། །ཞི་ལ་མོས་པས་རྒྱལ་བ་ལྟ། །འཁོར་རྣམས་རྣམ་པར་དང་བས་ན།
en: And then the goddesses became silent and gazed upon the Jina.

source: །བདེ་གཤེགས་སྲས་ལ་ཡང་སྨྲས་པ།
en: The serene assembly said to the bodhisattva,

source: །དམ་ཆོས་སྤྱོད་པའི་སྤྱོད་པ་རྣམས།
en: “Teach us the conduct of the kings of the Dharma that is higher than the eighth.”

source: །བརྒྱད་པའི་གོང་དུ་ཡང་གསུངས་ཤིག །བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་སྙིང་པོས་སྨྲས་པ།
en: The bodhisattva Vajra­garbha said, “O jinaputras!

source: ཀྱེ་རྒྱལ་བའི་སྲས་དག །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་སེམས་དཔའི་ས་བརྒྱད་པ་ལ་གནས་པ་ནི་དེ་ལྟ་བུའི་བློ་ཚད་མེད་པའི་ཡེ་ཤེས་ཀྱིས་རྣམ་པར་དཔྱད་པས་དེ་ནས་གོང་དུ་རྣམ་པར་ཐར་པ་ཞི་བ་ལ་མོས་པར་ཞེ་ནོན་ཅིང་དེ་ནས་གོང་དུ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཤིན་ཏུ་རྫོགས་པ་རྣམ་པར་སྤྱད་པ་དང་། དེ་བཞིན་གཤེགས་པས་གསུངས་པའི་རྗེས་སུ་འཇུག་པར་བྱ་བ་ལ་འཇུག་པ་དང་། ཡེ་ཤེས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཆེ་བ་ཉིད་རྣམ་པར་དབྱེ་བ་དང་། གཟུངས་དང་། ཏིང་ངེ་འཛིན་རབ་ཏུ་དབྱེ་བ་ཡོངས་སུ་སྦྱང་བ་དང་། མངོན་པར་ཤེས་པ་རྒྱ་ཆེན་པོ་མངོན་པར་བསྒྲུབ་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྣམ་པར་དབྱེ་བ་ཁོང་དུ་ཆུད་པར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཡོངས་སུ་མི་འཕྲོགས་པ་སྦྱང་བར་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བའི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། སྙིང་རྗེ་ཆེན་པོའི་མཐུ་ཕྱུང་བ་ཡོངས་སུ་མྱི་གཏོང་བར་བྱེད་པས། བྱང་ཆུབ་སེམས་དཔའི་ས་དགུ་པ་ཡོངས་སུ་གནོན་ཏེ།
en: The bodhisattva on the eighth bodhisattva bhūmi who has the understanding that analyzes immeasurable knowledge, (1) who is focused on the aspiration to higher peace and liberation, ( ) who examines the higher complete wisdom of the tathāgatas, (3) who enters into the secret of the tathāgatas, (4) who examines the greatness of inconceivable wisdom, (5) who examines and purifies retentions and samādhis, (6) who accomplishes vast clairvoyance, (7) who observes the categories of different worlds, (8) who trains for the unassailable strengths, confidences, and unique buddha qualities of the tathāgatas, (9) who follows the mighty turning of the Dharma wheel by the tathāgatas, and (10) who does not abandon obtaining the empowerment of great compassion, ascends to the ninth bodhisattva bhūmi.

source: དེ་བྱང་ཆུབ་སེམས་དཔའི་ས་འདི་ལ་གནས་པའི་ཚེ། དགེ་བ་དང་། མི་དགེ་བ་དང་། ལུང་དུ་མ་བསྟན་པའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: “When he is on this bodhisattva bhūmi, Perfect Understanding, he knows perfectly the development of good, bad, and neutral qualities;

source: །ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་། བསམ་པ་དང་བསམ་དུ་མེད་པའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་ངེས་པ་དང་། མ་ངེས་པའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་། དེ་བཞིན་གཤེགས་པའི་སའི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་། འདུས་བྱས་ཀྱི་ཆོས་མངོན་པར་འདུ་བྱ་བ་དང་། འདུས་མ་བྱས་ཀྱི་ཆོས་མངོན་པར་འདུ་བྱ་བ་ཡང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: he knows the development of the sullied and unsullied qualities, the development of the mundane and transcendent qualities, the development of conceivable and inconceivable qualities, the development of definite and indefinite qualities, the development of śrāvaka and pratyekabuddha qualities, the development of the qualities of bodhisattva conduct, the development of the qualities on the bhūmi of the tathāgatas, the development of composite qualities, and the development of noncomposite qualities.

source: །དེ་དེ་ལྟ་བུའི་ཤེས་པར་བྱ་བ་ཁོང་དུ་ཆུད་པའི་བློས་སེམས་ཅན་གྱི་སེམས་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “With the intelligence that has gained that wisdom he knows perfectly the complex mode of activity of the minds of beings.

source: ཉོན་མོངས་པའི་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། ལས་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། དབང་པོ་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། མོས་པའི་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། ཁམས་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། བསམ་པ་དང་བག་ལ་ཉལ་བ་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། སྐྱེ་བ་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་དང་། ཕུང་པོ་གསུམ་དུ་རྣམ་པར་གནས་པའི་ཐིབས་པོ་རབ་ཏུ་རྒྱུ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: He knows perfectly the complex mode of activity of the kleśas, the complex mode of activity of karma, the complex mode of activity of the faculties, the complex mode of activity of motivations, the complex mode of activity of the sensory elements, the complex mode of activity of intentions and propensities, the complex mode of activity of generation, the complex mode of activity of adhering to tendencies, and the complex mode of activity of the states of the three groups.

source: །དེ་ནི་སེམས་ཅན་རྣམས་ཀྱི་སེམས་རྣམ་པ་ཐ་དད་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows perfectly the various aspects of the minds of beings.

source: སེམས་རྣམ་པ་སྣ་ཚོགས་དང་། སེམས་སྐད་ཅིག་ཏུ་མྱུར་དུ་འགྱུར་ཞིང་འཇིག་པ་དང་མི་འཇིག་པ་དང་། སེམས་ལུས་མེད་པ་དང་། སེམས་མཐའ་ཡས་ཤིང་ཐམས་ཅད་དུ་དབང་བྱེད་པ་དང་། སེམས་འོད་གསལ་ཞིང་དང་བ་དང་། སེམས་ཉོན་མོངས་པ་དང་བཅས་པ་དང་། ཉོན་མོངས་པ་མེད་པ་དང་། སེམས་བཅིངས་པ་དང་། རྣམ་པར་གྲོལ་བ་དང་། སེམས་སྒྱུ་མ་ལྟ་བུར་རྣམ་པར་བསྒྲུབ་པ་དང་། སེམས་འགྲོ་བའི་རྒྱུད་ཇི་ལྟ་བ་བཞིན་དུ་ཉེ་བར་གནས་པ་ནས།
en: He knows perfectly the mind’s multiplicity; the mind’s instantaneous, swift change, fragmentation, and nonfragmentation; the mind’s bodilessness; the mind’s infinite, complete abundance; the mind’s clarity; the mind’s state of being afflicted; the mind’s state of being unafflicted; the mind’s bondage and liberation;

source: སེམས་རྣམ་པ་སྣ་ཚོགས། སྟོང་ཕྲག་དུ་མའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: the mind’s illusory manifestation; the mind’s concord with a class of existence; and so on, up to many thousands of different aspects of mind.

source: །དེ་ནི་ཉོན་མོངས་པ་རྣམས་རིང་དུ་སོང་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows perfectly the pervasiveness of the kleśas. He knows perfectly their infinite applications; their simultaneous arising and inseparability;

source: སྦྱོར་བ་མཐའ་ཡས་པ་དང་ལྷན་ཅིག་སྐྱེས་ཤིང་ཐ་མི་དད་པ་དང་། བག་ལ་ཉལ་བ་དང་། ཀུན་ནས་འཁོར་བའི་གནས་གཅིག་པ་དང་། སེམས་དང་ལྡན་པ་དང་། མི་ལྡན་པ་དང་སྐྱེ་བའི་མཚམས་སྦྱོར་བ་དང་། ལམ་གྱི་རྒྱུད་ཇི་ལྟ་བ་བཞིན་དུ་ཉེ་བར་གནས་པ་དང་། ཁམས་གསུམ་རྣམ་པར་ཕྱེ་བ་དང་། སྲེད་པ་དང་། མ་རིག་པ་དང་། ལྟ་བའི་ཟུག་རྔུ་དང་། ང་རྒྱལ་དང་གཏི་མུག་གི་ཁ་ན་མ་ཐོ་བ་ཆེན་པོ་དང་། ལས་རྣམ་པ་གསུམ་གྱི་གཞི་རྒྱུན་མྱི་འཆད་པ་ནས་མདོར་བསྡུ་ན་ཉོན་མོངས་པའི་རྒྱུད་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་བར་དུ་རྗེས་སུ་འཇུག་པར་བྱ་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: the single meaning of their propensities and their dominance; their being conjoined with the mind and not being conjoined with the mind; their causing the connection with rebirth in accordance with a class of existence; their divisions within the three realms; their great faults of craving, ignorance, binding views, and pride; their being the unceasing cause of the three kinds of karma; and so on—in brief, eighty-four thousand different modes of activity of the kleśas.

source: །དེ་ནི་ལས་དགེ་བ་དང་། མི་དགེ་བ་དང་། ལུང་དུ་མ་བསྟན་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་ཏེ།
en: “He knows perfectly the goodness, badness, and neutrality of actions. He knows perfectly their being known and not known; their being connate with and inseparable from the mind; that they cease to exist in their own instant while being connected with the development of their own result, which will never be lost; their having ripened and their not having ripened; the various kinds of results received from the many kinds of actions—good, bad, and neither good nor bad; the limitlessness of the realms of karma;

source: རྣམ་པར་དམྱིགས་པ་དང་། རྣམ་པར་མི་དམྱིགས་པ་དང་། སེམས་དང་ལྷན་ཅིག་ཏུ་སྐྱེས་ཤིང་ཐ་མི་དད་པ་དང་། རང་གི་ངང་གིས་སྐད་ཅིག་ཏུ་རྒྱུས་འབྱུང་ཞིང་འཇིག་ལ་འབྲས་བུ་ཆུད་མྱི་ཟ་བར་མཚམས་སྦྱོར་བ་དང་། རྣམ་པར་སྨིན་པ་ཡོད་པ་དང་། རྣམ་པར་སྨིན་པ་མེད་པ་དང་། ནག་པོ་དང་། དཀར་པོ་དང་། མྱི་དཀར་མྱི་གནག་པ་དང་། ཕྱོགས་དུ་མའི་ལས་ཡོངས་སུ་ལེན་པ་རྣམ་པ་ཐ་དད་པ་དང་། ལས་ཀྱི་ཞིང་ཚད་མེད་པ་དང་འཕགས་པ་དང་། འཇིག་རྟེན་པ་རྣམ་པར་ཕྱེ་བ་དང་། འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་རྣམ་པར་དགོད་པ་དང་། ཉེ་བར་ལེན་པ་དང་བཅས་པ་དང་། ཉེ་བར་ལེན་པ་མྱེད་པ་དང་། འདུས་བྱས་དང་། འདུས་མ་བྱས་དང་། ཚེ་འདི་དང་སྐྱེ་བ་དང་། རྒྱུད་གཞན་དུ་ཚོར་བར་འགྱུར་བ་དང་། ཐེག་པ་དང་ཐེག་པ་མ་ཡིན་པར་ངེས་པ་དང་མ་ངེས་པ་ནས།
en: the division between the higher and the worldly; the differen­tiation of transcendent qualities; the acquired and the unacquired; the completed and the uncompleted; those that have results experienced in this life, the next life, or another lifetime; those that are yānas and not yānas, definite and indefinite;

source: ལས་རྣམ་པ་ཐ་དད་པ་སྟོང་ཕྲག་བརྒྱད་ཅུ་རྩ་བཞིའི་བར་དུ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་ཤེས་སོ།
en: and so on, up to eighty-four thousand aspects of karma.
